Revit 2027 API
SunAndShadowSettings.TimeInterval Property
 Identifies the time interval between animation frames.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SunStudyTimeInterval TimeInterval { get; set; }
Public Property TimeInterval As SunStudyTimeInterval
	Get
	Set
public:
property SunStudyTimeInterval TimeInterval {
	SunStudyTimeInterval get ();
	void set (SunStudyTimeInterval value);
}
member TimeInterval : SunStudyTimeInterval with get, set
Property Value
SunStudyTimeInterval
Exceptions
Exception | Condition
ArgumentException |  When setting this property: the time interval value interval is not valid for the current SunAndShadowType.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace